Revit 2027 API
ReferencePoint.CoordinatePlaneVisibility Property
Visibility settings for the coordinate reference planes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CoordinatePlaneVisibility CoordinatePlaneVisibility { get; set; }
Public Property CoordinatePlaneVisibility As CoordinatePlaneVisibility
	Get
	Set
public:
property CoordinatePlaneVisibility CoordinatePlaneVisibility {
	CoordinatePlaneVisibility get ();
	void set (CoordinatePlaneVisibility value);
}
member CoordinatePlaneVisibility : CoordinatePlaneVisibility with get, set
Property Value
CoordinatePlaneVisibility
See Also
Reference
ReferencePoint Class
Autodesk.Revit.DB Namespace